/*
Для участия в отборе, необходимо выполнить все 6 заданий и вкоммитать их в git репозиторий ОДНИМ проектом.
Ссылка на репозиторий должна быть прикреплена к форме регистрации, в необходимом поле.
Тестовые задания принимаются до 10 мая.
Задание должно быть выполнено на языке Java.
Решение каждой задачи должно лежать в отдельном пакете проекта.
Приветствуется соответствие принципам ООП и сильного сцепления.
Все сообщения должны быть выведены пользователю в консоль, с помощью метода System.out.print(ln).

Критерии оценки:
Работоспособность и соответствие условиям задачи.
Оптимальность выбранного решения.
Стиль кода.
*/

public class Runner {
    public static void main(String[] args) {
        /*
        Uncomment required task to run
        */

        //Task 1:

        new Task1().solve();

        //Task 2:

//        new Task2().solve();

        //Task 3:

//        new Task3().solve();

        //Task 4:

//        new Task4().solve();

        //Task 5:

//        new Task5().solve();

        //Task 6:

//        new Task6(3).solve();
    }
}
